["Do you think boys are easier to take care of than girls or vice versa? Why?",
"Is it ever all right to give only a partial truth??",
"The eyes have been called 'the window to the soul'. What do you think that means?",
"Should humanity aim to spend more time outside?",
"Do you prefer to text ortalk on the phone? Why?",
"Should boys and girls be brought up differently?",
"Should anti-vaxxers be forced to vaccinate their kids?",
"What do you think is the most important ingredient in a good marriage?",
"Cultural appropriation or cultural appreciation? What’s the difference?",
"How do you know if something is “normal”?",
"Would you marry someone that your friends and family didn't like?",
"I am a mixed raced child. Will any country ever accept me as one of their own?",
"What are the positive and negative effects of texting?",
"Have you ever been homesick?",
"Should doctor-assisted suicide be allowed?",
"What is the difference between stereotypes and prejudices?",
"Do men/men friendships differ from women/men or women/women friendships? How?",
"Is torture ever justified?",
"Has social media ruined society?",
"What does it mean to “be yourself”? Do you think you are these days? How can you be more yourself?",
"What is the biggest challenge facing the next generation?",
"What are some examples of justified violence that you can accept?",
"Should prisoners be allowed to vote?",
"Is too much praise bad for children?",
"Do you think gossip can be used for something good?",
"What jobs are deemed as appropriate for men but inappropriate for women?",
"Is it selfish to have children?",
"Is it important to be a risk taker?",
"Do you think language affects thought?",
"Is dishonesty every justifiable?",
"Is there a different between dishonesty and lying?",
"Do you think parents should be married or it is not important?",
"What positive or negative changes take place in the life of a couple after marriage?",
"What is the best age for a man or woman to get married?",
"Is it difficult for people without a college education to get good jobs where you live?",
"Do you think teachers are paid enough?",
"Are first impressions important?",
"Is it okay to tell white lies? When is a white lie acceptable?",
"What would be one thing you hope your spouse remembers most about you if you were to die before him/her?",
"Who are you thankful for?",
"Do you think arranged marriages are a good idea? Why or why not?",
"Do you think love is necessary to have a good marriage?",
"How long do you think couples should know each other before they get married?",
"If everyone were able to communicate telepathically, what would be different?",
"Do you think it's acceptable for parents to use corporal punishment as a means of discipline? Why/why not?",
"What do you think is the most serious problem in the world?",
"Is it morally right to spend a lot of money on pets, rather than helping people in need?",
"Do you think that minorities should be given job priority because of their race (or gender, sexuality, etc.)? Why/why not?",
"Do you think tourism is harmful to the earth?"]
